HJW-22/stm32F103_jxCar/5_Hardware/oled.c
#include "oled_font.h"
#include "delay.h"
#include "oled.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>
#include "bsp_i2c.h"
#include "stm32f10x_dma.h"

#define OLED_ADDRESS      0x3CU
#define OLED_I2C          I2C1
#define OLED_I2C_SPEED_HZ 400000U
#define OLED_I2C_TIMEOUT  10000U
#define OLED_WIDTH       128U
#define OLED_HEIGHT      64U

static void OLED_WriteCommand(uint8_t control, uint8_t command)
{
    (void)BSP_I2C_MemWrite(OLED_I2C, OLED_ADDRESS, control, &command, 1U);
}

static void OLED_WriteData(uint8_t control, uint16_t count, const uint8_t *data)
{
    (void)BSP_I2C_MemWrite(OLED_I2C, OLED_ADDRESS, control, data, count);
}

static uint8_t OLED_I2C_WaitEvent(uint32_t event)
{
    uint32_t timeout = OLED_I2C_TIMEOUT;

    while (I2C_CheckEvent(OLED_I2C, event) != SUCCESS) {
        if (timeout-- == 0U) {
            I2C_GenerateSTOP(OLED_I2C, ENABLE);
            return 0U;
        }
    }
    return 1U;
}

/* Start an SSD1306 display-data transaction and leave it open for DMA. */
static uint8_t OLED_DMA_BeginTransfer(void)
{
    if (!BSP_I2C_WaitIdle(OLED_I2C)) return 0U;

    I2C_GenerateSTART(OLED_I2C, ENABLE);
    if (!OLED_I2C_WaitEvent(I2C_EVENT_MASTER_MODE_SELECT)) return 0U;
    I2C_Send7bitAddress(OLED_I2C, (uint8_t)(OLED_ADDRESS << 1), I2C_Direction_Transmitter);
    if (!OLED_I2C_WaitEvent(I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) return 0U;
    I2C_SendData(OLED_I2C, 0x40U);
    return OLED_I2C_WaitEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED);
}

uint8_t OLED_DisplayBuf[8][128];

// #define OLED_CHRONOLOGY_DELAY_FLAG

// #ifdef OLED_CHRONOLOGY_DELAY_FLAG
// #define OLED_CHRONOLOGY_DELAY_TIME 1 // 纳秒(us)为单位延时
// uint8_t OLED_Delay = OLED_CHRONOLOGY_DELAY_TIME;
// #endif

// #define OLED_GPIO_GROUP GPIOB
// #define OLED_GPIO_CLK   RCC_APB2Periph_GPIOB
// #define OLED_I2C_SCL    GPIO_Pin_8
// #define OLED_I2C_SDA    GPIO_Pin_9

/*
//------------------------软件I2C基本时序部分------------------------
void OLED_I2C_W_SCL(uint8_t BitValue)
{
    GPIO_WriteBit(OLED_GPIO_GROUP, OLED_I2C_SCL, (BitAction)BitValue);
#ifdef OLED_CHRONOLOGY_DELAY_FLAG
    Delay_us(OLED_Delay);
#endif // OLED_CHRONOLOGY_DELAY_FLAG
}

void OLED_I2C_W_SDA(uint8_t BitValue)
{
    GPIO_WriteBit(OLED_GPIO_GROUP, OLED_I2C_SDA, (BitAction)BitValue);
#ifdef OLED_CHRONOLOGY_DELAY_FLAG
    Delay_us(OLED_Delay);
#endif // OLED_CHRONOLOGY_DELAY_FLAG
}

uint8_t OLED_I2C_R_SDA(void)
{
    uint8_t BitValue;
    BitValue = GPIO_ReadInputDataBit(OLED_GPIO_GROUP, OLED_I2C_SDA);
    return BitValue;
}

uint8_t OLED_I2C_R_SCL(void)
{
    uint8_t BitValue;
    BitValue = GPIO_ReadInputDataBit(OLED_GPIO_GROUP, OLED_I2C_SCL);
    return BitValue;
}

void OLED_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_APB2PeriphClockCmd(OLED_GPIO_CLK, ENABLE);

    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_OD; // 开漏输出
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin   = OLED_I2C_SCL | OLED_I2C_SDA;
    GPIO_Init(OLED_GPIO_GROUP, &GPIO_InitStructure);

    GPIO_SetBits(GPIOB, OLED_I2C_SCL | OLED_I2C_SDA);
}

void OLED_I2C_Start(void)
{
    OLED_I2C_W_SDA(1);
    OLED_I2C_W_SCL(1);
    OLED_I2C_W_SDA(0);
    OLED_I2C_W_SCL(0);
}

void OLED_I2C_Stop(void)
{
    OLED_I2C_W_SDA(0);
    OLED_I2C_W_SCL(1);
    OLED_I2C_W_SDA(1);
}

void OLED_I2C_SendByte(uint8_t Byte)
{
    uint8_t i;

    for (i = 0; i < 8; i++) {
        OLED_I2C_W_SDA(!!(Byte & (0x80 >> i)));
        OLED_I2C_W_SCL(1);
        OLED_I2C_W_SCL(0);
    }
    OLED_I2C_W_SCL(1);
    OLED_I2C_W_SCL(0);
}

void OLED_WriteCommand(uint8_t address, uint8_t Command)
{
    OLED_I2C_Start();
    OLED_I2C_SendByte(OLED_ADDRESS);
    OLED_I2C_SendByte(address);
    OLED_I2C_SendByte(Command);
    OLED_I2C_Stop();
}

void OLED_WriteData(uint8_t address, uint8_t *Data, uint8_t Count)
{
    uint8_t i;
    OLED_I2C_Start();
    OLED_I2C_SendByte(OLED_ADDRESS);
    OLED_I2C_SendByte(address);
    for (i = 0; i < Count; i++) {
        OLED_I2C_SendByte(Data[i]);
    }
    OLED_I2C_Stop();
}
*/

//------------------------软件I2C通讯部分------------------------

/* OLED初始化 */
void OLED_Init(void)
{
    BSP_I2C_Init(OLED_I2C, 1U, OLED_I2C_SPEED_HZ);
    Delay_ms(100); // 重要延时，等待OLED电源稳定

    // 软件初始化（SSD1306命令配置）
    OLED_WriteCommand(0x00, 0xAE); // 关闭显示（DISPLAYOFF）

    /* 基础显示设置 */
    OLED_WriteCommand(0x00, 0x20); // 设置内存地址模式（Memory Addressing Mode）
    OLED_WriteCommand(0x00, 0x00); // 水平地址模式（Horizontal Addressing Mode）
    OLED_WriteCommand(0x00, 0xB0); // 设置页起始地址（Page Start Address）
    OLED_WriteCommand(0x00, 0xC8); // 设置COM输出扫描方向（COM Output Scan Direction）：反向（从下到上）
    OLED_WriteCommand(0x00, 0x00); // 设置列地址低4位（Lower Column Start Address）
    OLED_WriteCommand(0x00, 0x10); // 设置列地址高4位（Higher Column Start Address）
    OLED_WriteCommand(0x00, 0x40); // 设置显示起始行（Display Start Line）：0
    OLED_WriteCommand(0x00, 0x81); // 设置对比度控制（Contrast Control）
    OLED_WriteCommand(0x00, 0xFF); // 对比度值（最大亮度，0xFF）
    OLED_WriteCommand(0x00, 0xA1); // 设置段重映射（Segment Re-map）：列地址127映射到SEG0（水平翻转）
    OLED_WriteCommand(0x00, 0xA6); // 设置正常显示（Normal Display，非反色）
    OLED_WriteCommand(0x00, 0xA8); // 设置多路复用比率（Multiplex Ratio）
    OLED_WriteCommand(0x00, 0x3F); // 默认值0x3F（对应64行）
    OLED_WriteCommand(0x00, 0xA4); // 禁用全局显示（Disable Entire Display On）
    OLED_WriteCommand(0x00, 0xD3); // 设置显示偏移（Display Offset）
    OLED_WriteCommand(0x00, 0x00); // 无偏移（Vertical Shift = 0）

    /* 时序和电源配置 */
    OLED_WriteCommand(0x00, 0xD5); // 设置显示时钟分频（Display Clock Divide Ratio/Oscillator Frequency）
    OLED_WriteCommand(0x00, 0xF0); // 默认分频比（0xF0）
    OLED_WriteCommand(0x00, 0xD9); // 设置预充电周期（Pre-charge Period）
    OLED_WriteCommand(0x00, 0x22); // Phase1 = 2 DCLK, Phase2 = 2 DCLK
    OLED_WriteCommand(0x00, 0xDA); // 设置COM引脚配置（COM Pins Hardware Configuration）
    OLED_WriteCommand(0x00, 0x12); // 序列模式（Sequential COM Pin Config），禁用左右复用（Alternative COM Pin Disable）
    OLED_WriteCommand(0x00, 0xDB); // 设置VCOMH电压（VCOMH Deselect Level）
    OLED_WriteCommand(0x00, 0x20); // 默认值0x20（~0.77 * VCC）

    /* 电源管理 */
    OLED_WriteCommand(0x00, 0x8D); // 设置电荷泵（Charge Pump Setting）
    OLED_WriteCommand(0x00, 0x14); // 启用电荷泵（Enable Charge Pump）
    OLED_WriteCommand(0x00, 0xAF); // 开启显示（DISPLAYON）

