HJW-22/stm32F103_jxCar/5_Hardware/oled.c
    /* 初始化后处理 */
    OLED_Clear();  // 清空显存（全写0）
    OLED_Update(); // 更新显示，防止初始化后花屏
}

/**
 * @brief  OLED设置光标位置
 * @param  Y 以左上角为原点，向下方向的坐标，范围：0~7
 * @param  X 以左上角为原点，向右方向的坐标，范围：0~127
 * @retval 无
 */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
    OLED_WriteCommand(0x00, 0xB0 | Y);                 // 设置Y位置
    OLED_WriteCommand(0x00, 0x10 | ((X & 0xF0) >> 4)); // 设置X位置高4位
    OLED_WriteCommand(0x00, 0x00 | (X & 0x0F));        // 设置X位置低4位
}

/**
 * @brief  OLED次方函数
 * @retval 返回值等于X的Y次方
 */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
    uint32_t Result = 1;
    while (Y--) {
        Result *= X;
    }
    return Result;
}

/**
 * @brief  显存数组清零
 * @param  无
 * @retval 无
 */
void OLED_Clear(void)
{
    uint8_t i, j;
    for (j = 0; j < 8; j++) {
        for (i = 0; i < 128; i++) {
            OLED_DisplayBuf[j][i] = 0x00;
        }
    }
}

/**
 * @brief 显存数组部分清零
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Width 指定图像的宽度   范围:0~128
 * @param  Height 指定图像的高度   范围:0~64
 * @retval 无
 */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
    int16_t i, j;

    for (j = Y; j < Y + Height; j++) // 遍历指定页
    {
        for (i = X; i < X + Width; i++) // 遍历指定列
        {
            if (i >= 0 && i <= 127 && j >= 0 && j <= 63) // 超出屏幕的内容不显示
            {
                OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8)); // 将显存数组指定数据清零
            }
        }
    }
}

/**
 * @brief  显存数组全部取反
 * @param  无
 * @retval 无
 */
void OLED_Reverse(void)
{
    uint8_t i, j;
    for (j = 0; j < 8; j++) // 遍历8页
    {
        for (i = 0; i < 128; i++) // 遍历128列
        {
            OLED_DisplayBuf[j][i] ^= 0xFF; // 将显存数组数据全部取反
        }
    }
}

/**
 * @brief 显存数组部分取反
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Width 指定图像的宽度   范围:0~128
 * @param  Height 指定图像的高度   范围:0~64
 * @retval 无
 */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
    int16_t i, j;

    for (j = Y; j < Y + Height; j++) // 遍历指定页
    {
        for (i = X; i < X + Width; i++) // 遍历指定列
        {
            if (i >= 0 && i <= 127 && j >= 0 && j <= 63) // 超出屏幕的内容不显示
            {
                OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8); // 将显存数组指定数据取反
            }
        }
    }
}

/**
 * @brief  显存数组写入到OLED硬件
 * @param  无
 * @retval 无
 */
void OLED_Update(void)
{
    uint8_t j;
    /*遍历每一页*/
    for (j = 0; j < 8; j++) {
        /*设置光标位置为每一页的第一列*/
        OLED_SetCursor(j, 0);
        /*连续写入128个数据，将显存数组的数据写入到OLED硬件*/
        OLED_WriteData(0x40, 128, OLED_DisplayBuf[j]);
    }
}

/**
 * @brief 显存数组部分写入到OLED硬件
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Width 指定图像的宽度   范围:0~128
 * @param  Height 指定图像的高度   范围:0~64
 * @retval 无
 */
void OLED_UpdateArea(int16_t X, int16_t Y, int16_t Width, int16_t Height)
{
    int16_t j;
    int16_t page, page1;

    page  = Y / 8; // 获取页区
    page1 = (Y + Height - 1) / 8 + 1;
    if (Y < 0) {
        page -= 1;
        page1 -= 1;
    }

    /*遍历指定区域涉及的相关页*/
    for (j = page; j < page1; j++) {
        if (X >= 0 && X <= 127 && j >= 0 && j <= 7) // 超出屏幕的内容不显示
        {
            /*设置光标位置为相关页的指定列*/
            OLED_SetCursor(j, X);
            /*连续写入Width个数据，将显存数组的数据写入到OLED硬件*/
            OLED_WriteData(0x40, Width, &OLED_DisplayBuf[j][X]);
        }
    }
}

/**
 * @brief  设置 SSD1306 后续显存写入的水平/页寻址窗口
 * @note   Y 与 Height 以像素为单位，内部会扩展到覆盖区域的整页。
 */
void OLED_SetWindow(uint8_t X, uint8_t Y, uint8_t Width, uint8_t Height)
{
    uint8_t PageStart;
    uint8_t PageEnd;

    if ((X >= OLED_WIDTH) || (Y >= OLED_HEIGHT) || (Width == 0) || (Height == 0)) {
        return;
    }

    if ((uint16_t)X + Width > OLED_WIDTH) {
        Width = OLED_WIDTH - X;
    }
    if ((uint16_t)Y + Height > OLED_HEIGHT) {
        Height = OLED_HEIGHT - Y;
    }

    PageStart = Y / 8;
    PageEnd   = (Y + Height - 1) / 8;

    OLED_WriteCommand(0x00, 0x21);
    OLED_WriteCommand(0x00, X);
    OLED_WriteCommand(0x00, X + Width - 1);
    OLED_WriteCommand(0x00, 0x22);
    OLED_WriteCommand(0x00, PageStart);
    OLED_WriteCommand(0x00, PageEnd);
}

/**
 * @brief  OLED显示一个字符
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Char 指定要显示的字符，范围：ASCII码可见字符
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, int16_t FontSize)
{
    if (FontSize == OLED_8X16) // 字体为宽8像素，高16像素
    {
        /*将ASCII字模库OLED_F8x16的指定数据以8*16的图像格式显示*/
        OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
    } else if (FontSize == OLED_6X8) // 字体为宽6像素，高8像素
    {
        /*将ASCII字模库OLED_F6x8的指定数据以6*8的图像格式显示*/
        OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
    }
}

/**
 * @brief  OLED显示字符串
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  String 指定要显示的字符串，范围：ASCII码可见字符或中文字符组成的字符串
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{

    uint16_t i = 0;
    char SingleChar[5];
    uint8_t CharLength = 0;
    uint16_t XOFFset   = 0;
    uint16_t pIndex;
    while (String[i] != '\0') {
#ifdef OLED_CHARSET_UTF8
        if ((String[i] & 0x80) == 0x00) {
            CharLength    = 1;
            SingleChar[0] = String[i++];
            SingleChar[1] = '\0';
        } else if ((String[i] & 0xE0) == 0xC0) // 第一个字节为110xxxxx
        {
            CharLength    = 2;                // 字符为2字节
            SingleChar[0] = String[i++];      // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
            if (String[i] == '\0') { break; } // 意外情况，跳出循环，结束显示
            SingleChar[1] = String[i++];      // 将第二个字节写入SingleChar第1个位置，随后i指向下一个字节
            SingleChar[2] = '\0';             // 为SingleChar添加字符串结束标志位
        } else if ((String[i] & 0xF0) == 0xE0) {
            CharLength    = 3;
            SingleChar[0] = String[i++];
            if (String[i] == '\0') break;
            SingleChar[1] = String[i++];
            if (String[i] == '\0') break;
            SingleChar[2] = String[i++];
            SingleChar[3] = '\0';
        } else if ((String[i] & 0xF8) == 0xF0) {
            CharLength    = 4;
            SingleChar[0] = String[i++];
            if (String[i] == '\0') break;
            SingleChar[1] = String[i++];
            if (String[i] == '\0') break;
            SingleChar[2] = String[i++];
            if (String[i] == '\0') break;
            SingleChar[3] = String[i++];
            SingleChar[4] = '\0';
        } else {
            i++;
            continue;
        }
#endif
#ifdef OLED_CHARSET_GB2312 // 定义字符集为GB2312
        /*此段代码的目的是，提取GB2312字符串中的一个字符，转存到SingleChar子字符串中*/
        /*判断GB2312字节的最高位标志位*/
        if ((String[i] & 0x80) == 0x00) // 最高位为0
        {
            CharLength    = 1;           // 字符为1字节
            SingleChar[0] = String[i++]; // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
            SingleChar[1] = '\0';        // 为SingleChar添加字符串结束标志位
        } else                           // 最高位为1
        {
            CharLength    = 2;                // 字符为2字节
            SingleChar[0] = String[i++];      // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
            if (String[i] == '\0') { break; } // 意外情况，跳出循环，结束显示
            SingleChar[1] = String[i++];      // 将第二个字节写入SingleChar第1个位置，随后i指向下一个字节
            SingleChar[2] = '\0';             // 为SingleChar添加字符串结束标志位
        }
#endif
        if (CharLength == 1) {
            OLED_ShowChar(X + XOFFset, Y, SingleChar[0], FontSize);
            XOFFset += FontSize;
        } else {
            for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex++) {
                if (strcmp(OLED_CF16x16[pIndex].Index, SingleChar) == 0) {
                    break;
                }
            }
            if (FontSize == OLED_8X16) {
                OLED_ShowImage(X + XOFFset, Y, 16, 16, OLED_CF16x16[pIndex].Data);
                XOFFset += 16;
            }

            else if (FontSize == OLED_6X8) {
                OLED_ShowChar(X + XOFFset, Y, '?', OLED_6X8);
                XOFFset += OLED_6X8;
            }
        }
    }
}

/**
 * @brief  OLED显示数字
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:0~4294967295
 * @param  Length 指定数字的长度   范围:0~10
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    for (i = 0; i < Length; i++) // 遍历数字的每一位
    {
        /*调用OLED_ShowChar函数，依次显示每个数字*/
        /*Number / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
        /*+ '0' 可将数字转换为字符格式*/
        OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
    }
}

/**
 * @brief  OLED显示带符号数字
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:-2147483648~2147483647
 * @param  Length 指定数字的长度   范围:0~10
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    uint32_t Number1;

