HJW-22/stm32F103_jxCar/5_Hardware/oled.c
    if (Number >= 0) // 数字大于等于0
    {
        OLED_ShowChar(X, Y, '+', FontSize); // 显示+号
        Number1 = Number;                   // Number1直接等于Number
    } else                                  // 数字小于0
    {
        OLED_ShowChar(X, Y, '-', FontSize); // 显示-号
        Number1 = -Number;                  // Number1等于Number取负
    }

    for (i = 0; i < Length; i++) // 遍历数字的每一位
    {
        /*调用OLED_ShowChar函数，依次显示每个数字*/
        /*Number1 / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
        /*+ '0' 可将数字转换为字符格式*/
        OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
    }
}

/**
 * @brief  OLED显示十六进制数
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:0x00000000~0xFFFFFFFF
 * @param  Length 指定数字的长度   范围:0~8
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i, SingleNumber;
    for (i = 0; i < Length; i++) // 遍历数字的每一位
    {
        /*以十六进制提取数字的每一位*/
        SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;

        if (SingleNumber < 10) // 单个数字小于10
        {
            /*调用OLED_ShowChar函数，显示此数字*/
            /*+ '0' 可将数字转换为字符格式*/
            OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
        } else // 单个数字大于10
        {
            /*调用OLED_ShowChar函数，显示此数字*/
            /*+ 'A' 可将数字转换为从A开始的十六进制字符*/
            OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
        }
    }
}

/**
 * @brief  OLED显示二进制数
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:0x00000000~0xFFFFFFFF
 * @param  Length 指定数字的长度   范围:0~16
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    for (i = 0; i < Length; i++) // 遍历数字的每一位
    {
        /*调用OLED_ShowChar函数，依次显示每个数字*/
        /*Number / OLED_Pow(2, Length - i - 1) % 2 可以二进制提取数字的每一位*/
        /*+ '0' 可将数字转换为字符格式*/
        OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
    }
}

/**
 * @brief  OLED显示浮点数
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:-4294967295.0~4294967295.0
 * @param  IntLength 指定数字的长度   范围:0~10
 * @param  FraLength 指定数字的小数位长度   范围:0~9，小数进行四舍五入显示
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @retval 无
 */
void OLED_ShowFloatNum(int16_t X, int16_t Y, float Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
    uint32_t PowNum, IntNum, FraNum;

    if (Number >= 0) // 数字大于等于0
    {
        OLED_ShowChar(X, Y, '+', FontSize); // 显示+号
    } else                                  // 数字小于0
    {
        OLED_ShowChar(X, Y, '-', FontSize); // 显示-号
        Number = -Number;                   // Number取负
    }

    /*提取整数部分和小数部分*/
    IntNum = Number;                  // 直接赋值给整型变量，提取整数
    Number -= IntNum;                 // 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
    PowNum = OLED_Pow(10, FraLength); // 根据指定小数的位数，确定乘数
    FraNum = round(Number * PowNum);  // 将小数乘到整数，同时四舍五入，避免显示误差
    IntNum += FraNum / PowNum;        // 若四舍五入造成了进位，则需要再加给整数

    /*显示整数部分*/
    OLED_ShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);

    /*显示小数点*/
    OLED_ShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);

    /*显示小数部分*/
    OLED_ShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
 * @brief  OLED显示无符号浮点数
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Number 指定要显示的数字   范围:0.0~4294967295.0
 * @param  IntLength 整数部分长度   范围:0~10
 * @param  FraLength 小数部分长度   范围:0~9（四舍五入）
 * @param  FontSize 字体大小   范围:OLED_8X16或OLED_6X8
 * @retval 无
 */
void OLED_ShowUnsignedFloatNum(int16_t X, int16_t Y, float Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
    // 参数校验
    if (Number < 0) Number = 0; // 强制非负

    // 计算10^FraLength（避免重复计算）
    uint32_t PowNum = OLED_Pow(10, FraLength);

    // 分离整数和小数部分（优化浮点运算）
    uint32_t IntNum  = (uint32_t)Number;
    float fractional = Number - (float)IntNum;
    uint32_t FraNum  = round(fractional * PowNum);

    // 处理四舍五入进位
    if (FraNum >= PowNum) {
        FraNum -= PowNum;
        IntNum++;
    }

    // 显示整数部分
    OLED_ShowNum(X, Y, IntNum, IntLength, FontSize);

    // 如果有小数部分
    if (FraLength > 0) {
        // 显示小数点
        OLED_ShowChar(X + IntLength * FontSize, Y, '.', FontSize);

        // 显示小数部分（自动补前导零）
        OLED_ShowNum(X + (IntLength + 1) * FontSize, Y, FraNum, FraLength, FontSize);
    }
}
/**
 * @brief  OLED显示图像
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  Width 指定图像的宽度   范围:0~128
 * @param  Height 指定图像的高度   范围:0~64
 * @param  Image 指定要显示的图像
 * @retval 无
 */
void OLED_ShowImage(int16_t X, int16_t Y, int16_t Width, int16_t Height, const uint8_t *Image)
{
    int16_t j, i;
    int16_t page, shift;

    OLED_ClearArea(X, Y, Width, Height); // 区域置0

    // 页区循环,向上取整操作
    for (j = 0; j < (Height - 1) / 8 + 1; j++) {
        // 宽度循环
        for (i = 0; i < Width; i++) {
            if ((X + i < 0) || (X + i >= OLED_WIDTH)) {
                continue;
            }

            page  = Y / 8; // 获取页区
            shift = Y % 8; // 获取移位值
            // 如果为负值 +1
            if (Y < 0) {
                page -= 1;
                shift += 8;
            }
            // 先循环上半部分
            if (page + j >= 0 && page + j <= 7) {
                OLED_DisplayBuf[page + j][X + i] |= Image[j * Width + i] << (shift);
            }
            // 再循环上半部分
            if (page + j + 1 >= 0 && page + j + 1 <= 7) {
                OLED_DisplayBuf[page + j + 1][X + i] |= Image[j * Width + i] << (8 - shift);
            }
        }
    }
}

/**
 * @brief  OLED使用printf函数打印格式化字符串（支持ASCII码和中文混合写入）
 * @param  X 起始行位置   范围:0~127
 * @param  Y 起始列位置   范围:0~63
 * @param  FontSize 要显示的文字格式   范围:OLED_8X16		宽8像素，高16像素
 *                                        OLED_6X8		  宽6像素，高8像素
 * @param  format 指定要显示的格式化字符串   范围:ASCII码可见字符或中文字符组成的字符串
 * @param  ... 格式化字符串参数列表 范围:无
 * @retval 无
 */
void OLED_Printf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
    char String[256];                        // 定义字符数组
    va_list arg;                             // 定义可变参数列表数据类型的变量arg
    va_start(arg, format);                   // 从format开始，接收参数列表到arg变量
    vsprintf(String, format, arg);           // 使用vsprintf打印格式化字符串和参数列表到字符数组中
    va_end(arg);                             // 结束变量arg
    OLED_ShowString(X, Y, String, FontSize); // OLED显示字符数组（字符串）
}

