HJW-22/stm32F103_jxCar/5_Hardware/oled.c
uint8_t OLED_ID(void)
{
    return 1;
}

// OLED DMA部分
volatile uint8_t OLED_DMA_TransferComplete = 1U;

// DMA初始化
void OLED_DMA_Init(void)
{
    DMA_InitTypeDef DMA_InitStructure;

    // 开启DMA时钟
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    // 配置DMA通道（I2C1 TX用DMA1 Channel6）
    DMA_DeInit(DMA1_Channel6);

    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&(OLED_I2C->DR);
    DMA_InitStructure.DMA_MemoryBaseAddr     = (uint32_t)OLED_DisplayBuf;
    DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralDST; // 传输方向 寄存器->外设
    DMA_InitStructure.DMA_BufferSize         = 1024U;
    DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;   // 外设是否为递增
    DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;        // 存储器是否为递增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte; // 外设数据类型
    DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;     // 存储器数据类型
    DMA_InitStructure.DMA_Mode               = DMA_Mode_Normal;             // 模式  CIRC                  1位 循环(ADC) 标准
    DMA_InitStructure.DMA_Priority           = DMA_Priority_High;           // 优先级 PL                   2位 低 中 高 最高
    DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;             // 存储器到存储器模式 MEM2MEM   1位 非 启
    DMA_Init(DMA1_Channel6, &DMA_InitStructure);

    // 启用DMA传输完成中断
    DMA_ITConfig(DMA1_Channel6, DMA_IT_TC, ENABLE);

    // 配置NVIC
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel                   = DMA1_Channel6_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    DMA_ClearITPendingBit(DMA1_IT_GL6);
    I2C_DMACmd(OLED_I2C, ENABLE);
    I2C_DMALastTransferCmd(OLED_I2C, ENABLE);
    OLED_DMA_TransferComplete = 1U;
}

// DMA中断服务函数
void DMA1_Channel6_IRQHandler(void)
{
    if (DMA_GetITStatus(DMA1_IT_TC6) || DMA_GetITStatus(DMA1_IT_TE6)) {
        DMA_Cmd(DMA1_Channel6, DISABLE);
        DMA_ClearITPendingBit(DMA1_IT_GL6);
        I2C_GenerateSTOP(OLED_I2C, ENABLE);
        OLED_DMA_TransferComplete = 1U;
    }
}

// 带DMA的OLED刷新
void OLED_Update_DMA(void)
{
    if (OLED_DMA_TransferComplete == 0U) return;
    OLED_SetWindow(0, 0, OLED_WIDTH, OLED_HEIGHT);
    if (!OLED_DMA_BeginTransfer()) return;

    DMA_Cmd(DMA1_Channel6, DISABLE);
    DMA1_Channel6->CMAR = (uint32_t)OLED_DisplayBuf;
    DMA_SetCurrDataCounter(DMA1_Channel6, 1024U);
    DMA_ClearITPendingBit(DMA1_IT_GL6);
    OLED_DMA_TransferComplete = 0U;
    DMA_Cmd(DMA1_Channel6, ENABLE);
}
